Revit 2026 API

# IntersectionResultUVPoint Property

---

2d (or two 1d) parameters of the point of intersection.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV UVPoint { get; }
```
```vb
Public ReadOnly Property UVPoint As UV
	Get
```
```cpp
public:
property UV^ UVPoint {
	UV^ get ();
}
```
```fsharp
member UVPoint : UV with get
```

#### Property Value

UV

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

#### Reference

IntersectionResult Class

Autodesk.Revit.DB Namespace